{"pageProps":{"post":{"__typename":"Post","title":"CRDTs - Sound good in theory, not in practice","slug":"crdt","content":"This term I did some research on conflict-free replicated datatypes (CRDTs). I will walk through what they are, why the concept is cool, but they don't work in practice.\n\n# What are CRDTs?\nCRDT is a data structure that propagates concurrently in a network without the need for coordination.\nCRDTs are mathematically proven to not cause inconsistencies.\nThis property is desirable, since all partitions of a split-brain scenario can continue accepting writes.\nSince machines continue functioning independently, not all writes will immediately seen by all machines.\nCRDTs are used in eventually consistent systems.\n\nLet's look at a concrete example of a CRDT: a simple counter (G-Counter).\nTo represent a counter we actually maintain N counters, where N is the number of machines.\nEach machine independently increments its counter if it receives a write.\nWhen two machines communicate each one sends along the latest values of all counters it knows of.\nA machine then takes the max of the local value and the received value for each counter.\nWhen a user reads the value of a counter, the system returns the sum of all counters.\n\nBased on similar concepts we can construct other similar data types:\n* PN-Counter: A PN-Counter supports increments and decrements.\nThis is achieved by using two G-Counter, one keeps track of increments, the other one keeps track of decrements.\n* G-Set: A G-Set is a set to which elements can be added to, but not removed.\nSets are propagates by taking the union of the local set with the received set.\n* 2P-Set: A 2P-Set allows for adding and removing items once.\nOnce a item was removed, it can not be added again.\nA 2P-Set is achieved by maintaining a tombstone set.\nThe tombstone set indicates which elements to exclude from the return value.\n\nAnother frequently used CRDT is a LWW-Set (Last-Write-Wins).\nThis data structure is able to handle repeated additions and removals by timestamping each change.\nThe timestamp is generated using vector clocks.\nI personally do not like this data structure.\nVector clocks require consensus, consensus does not allow for a split-brain, and split-brain is a situation we fundamentally want to be able to handle with CRDTs.\n\n# My Research\n[Raymond](https://github.com/raymondxu/) and I wanted to test the viability of CRDTs in practice.\nFor this, we took an existing application and migrated components of it to a CRDT store.\n\nFor this, we chose the application Vataxia, a simple social network with a Django backend. The [frontend](https://github.com/buckyroberts/Vataxia-Frontend) and [backend](https://github.com/buckyroberts/Vataxia) are completely decoupled. As our storage layer we chosee [Riak](docs.basho.com/riak/kv/2.2.3/learn/concepts/crdts/), a well established CRDT store.\n\nWe attempted to mirror the functionality provided by Vataxia originally. The two components we migrated are Voting and Messaging.\n\n## Voting\nVoting in Vataxia is simple. We broke it down into a few requirements:\n* At most one Upvote or Downvote per user and post\n* Vote removal must be possible\n* No duplicate votes\n* Only upvote OR downvote\n\nTake a minute and think about how you would implement it.\nWe considered the following options:\n* Using per post Counters: Counters sound simple and intuitive.\nCounters do not check whether a user casted a duplicate vote, therefore this solution is not viable.\n* Having a Set of voters per post: We considered using a G-Set, thereby eliminating the possibility of duplicate votes. This approach did not account for removing or changing one's vote.\nWe also considered using a 2P-Set, but this did not allow for the sequence upvote - remove vote - upvote.\nThis did not work either.\nA LWW-Set fulfilled almost all requirements.\nYet, it did not work, because it did not allow to enforce only having an upvote OR a downvote, since we have to maintain a seperate upvote and downvote set.\n* A map per post with key user and value vote: Each post maintans a LWW-Map. On each post the key of the map is the user ID, while the value is true or false (upvote / downvote, absence = no vote). This solution ended up being the only approach that was able to replicate the semantics of Vataxia.\n\n## Messaging\nIn Vataxia messaging is akin to emails.\nIt does not allow for chats or threads.\nInstead one sends individual messages that Vataxia treats completely separately.\nThe problems we faced here were different.\nImplementing even a basic version was a lot harder.\n\nWe chose to use the following system.\nOur system maintains messages in a LLW-Map, where the key is the timestamp and the sender, while the value is the actual message.\nA G-Set maintained on the user referrences his sent and received messages.\nNote, that a G-Set is unordered, therefore we must address this on the application level.\nTo retrieve the latest messages we order the set on the user by timestamp and then fetch the latest messages.\nThis process can be expensive, since we load the identifier for every single message ever sent/received into memory and sort it.\n\n# Problems of CRDTs\nWe notice, that the LWW-Map is a crucial component for both components we converted.\nFor me personally that is a deal breaker for CRDTs.\nSince we rely so heavily on vector clocks, we rely on consensus.\nCRDTs do not circumvent consensus in those cases and do not make the implementation easier.\nOur implementations almost converged to the usage of a simple KeyValue-store, but with a more limited set of operations.\n\nThe other major criticism for CRDTs is privacy.\nIf we do not use vector clocks, data that is written to the store will never be deleted.\nEven a 2P-Set never truly deletes data, it merely marks it as hidden.\nIf an intruder gains access to the set, he/she can access the tombstone set and inspect deleted data.\nThose semantics are at odds with the EU \"right to be forgotten\".\n\n# Retrospective\nCRDTs are an interesting concept.\nIf an application can fit into the computational model of CRDTs excluding LWW semantics then CRDTs are a great options.\nAlmost no application can allow for those semantics.\nThe fact that deletion is often not possible is a crucial flaw.\n\n# Links\n[Repository](https://github.com/raymondxu/crdt-project)\n\n[Midterm presentation](https://docs.google.com/presentation/d/1i-AT59MD-DwwM-h1DFZUTj3qmx4_JYlojepA6IOauZI/edit?usp=sharing)\n\n[Final presentation](https://docs.google.com/presentation/d/1i-AT59MD-DwwM-h1DFZUTj3qmx4_JYlojepA6IOauZI/edit?usp=sharing)\n\n[Final paper](/uploads/crdt-paper.pdf)\n","date":"2018-05-05","ogImage":null,"coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphassets.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}},"moreStories":[{"__typename":"Post","title":"Systemd Services are frustratingly hard to make safe","slug":"systemd-frustration","excerpt":"This article takes a dive into what it takes to set up a systemd service with the principle of least privilege.","coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphassets.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}},{"__typename":"Post","title":"Variants are incredibly powerful","slug":"variants-are-powerful","excerpt":"Variants are an incredibly powerful tool to express the state of your program!","coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphassets.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}}],"__typename":"Query"},"__N_SSG":true}