{"pageProps":{"post":{"__typename":"Post","title":"How to CSP","slug":"how-to-csp","content":"I was recently looking at a friend's project. One peculiar thing that piqued my interest was the CSP policy they had configured. The relevant section of their `webpack.config.js` was:\n```js\nconst ONLOAD_NONCE = `${Math.random()}`.substring(2, 8);\n...\nnew CspHtmlWebpackPlugin({\n  'default-src': \"'self'\",\n  'script-src': `'self' 'nonce-${ONLOAD_NONCE}'`,\n}),\n```\nand their `index.html` was:\n```html\n<head>\n  <script nonce=\"<%= htmlWebpackPlugin.options.onloadNonce %>\">\n    console.log(\"Hello World\");\n  </script>\n</head>\n```\nThe reasoning is clear: They added the inline script and Chrome started complaining about it violating the CSP policy. The easiest way to solve this is to add a nonce. Unfortunately this solution effectively disables any protection that CSP offers. Crucially, the [spec](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Content-Security-Policy) states: \n\n> The server must generate a unique nonce value each time it transmits a policy.\n\nBy including the nonce as part of the build process, it will be the same for all clients using assets with that build version.\n\n## How can an attacker leverage this?\n\nRemember that CSP is another layer of defence. It by itself not working will not make a website vulnerable. Therefore we have to assume that there are other flaws in the website. Here is an example of how an XSS attack could happen:\n\nAt some point you decided to add a rich text field to your application, so that users can post well formatted messages. Since you are using react, you can simply use `<div dangerouslySetInnerHTML={post()} />` to display the data. Unfortunately an attacker discovered that, that they crafted a post content that can behave maliciously:\n```html\n<script>console.log(\"I can access your private data\")</script>\n```\nAny user viewing the post is now at risk of having their browser data, such as cookies, stolen. Thanks to your CSP policy this inline code will not execute. However, with a nonce per build the attacker can craft the post content to be:\n```html\n<script nonce=\"nonce-from-last-build\">console.log(\"I can access your private data\")</script>\n```\nThis script will happily be executed by the browser.\n\n## What should they have done instead?\n\nThere are two approaches to mitigate this issue. Whenever you can, you should favor the hash based approach, but in some cases that may not be possible.\n\n### Hash\n\nInstead of using a nonce for the script, it is sufficient to list the sha hash of the script in the CSP policy:\n```js\nnew CspHtmlWebpackPlugin({\n  'default-src': \"'self'\",\n  'script-src': `'self' 'sha256-${HASH_OF_SCRIPT}'`,\n}),\n```\nIn fact the plugin will do that automatically if the script is part of the build graph, so that you don't even need to list the hash.\n\nIn this approach we allowlist scripts with certain hashes. Since it is close to impossible to craft a script that matches the hash of an existing hash, this is sufficient to validate that a script is meant to be run.\n\n### Per request nonce\nIf the hash based approach does not suffice, you will need to generate a new nonce per request. This nonce should be inserted into the html sent to the client (potentially using a templating engine like ejs). Assuming you use [webpack](https://webpack.js.org/guides/csp/), you should have something similar to the following block in the html file:\n```html\n<script nonce=\"your-nonce\">\n__webpack_nonce__ = 'your-nonce';\n</script>\n```\nThis will allow webpack to leverage the generated nonce as needed.","date":"2021-08-29","ogImage":null,"coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphassets.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}},"moreStories":[{"__typename":"Post","title":"Systemd Services are frustratingly hard to make safe","slug":"systemd-frustration","excerpt":"This article takes a dive into what it takes to set up a systemd service with the principle of least privilege.","coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphassets.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}},{"__typename":"Post","title":"Variants are incredibly powerful","slug":"variants-are-powerful","excerpt":"Variants are an incredibly powerful tool to express the state of your program!","coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphassets.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}}],"__typename":"Query"},"__N_SSG":true}