{"pageProps":{"post":{"__typename":"Post","title":"Lamport Clocks","slug":"lamport-clocks","content":"I read Leslie Lamport's [Time, Clocks, and the Ordering of Events in a Distributed System](https://lamport.azurewebsites.net/pubs/time-clocks.pdf). The paper is concise, yet profound and impactful!!\n\nContent\nLamport's paper is about the ordering of events. His main goal is to provide an viable total ordering of events across machines based on a partial ordering. He starts with baby steps, by looking at before and after as a temporal ordering in the context of events. As he points out, determining whether one event occured before or after another one is not always possible due to the spacial distance of the machines. What we instead focus on is partial ordering. This concept is about whether some event a must have occured before b given the information a system has. If we know that a occured before b, then we say \"a --> b\", otherwise \"a --/> b\". If \"a --/> b\" and \"b --/> a\", then the events are concurrent.\n\nNow, we want to be able to have a order of events that all machines agree on and that respects partial ordering. To achieve this, Lamport introduces Logical Clocks. Each time some event occurs on a machine (such as receiving a message), it increments its clock. When two machines exchange a message, then the sender attaches timestamp. The receiver sets its timestamp to be greater than the message timestamp. With this, we can assign each event on a machine a timestamp. When we propagate events to other machines in the system the receiver uses the this timestamp to determine the ordering. The name of the machine generating the timestamp serves as tie breaker.\n\nWith this simple setup we are able to introduce a total ordering in the system. Note, that this setup disregards Machine failure and lost messages (both are non trivial to solve).\n\nWriting\nThe most fascinating part of the paper was not the result, but the way we obtained the result. Lamport's style of writing is incredibly clear and concise. Reading the paper is straightforward, yet the impact is profound. This paper revolutionized how we reason about events, time and synchronization. I wish more academics write papers this well.\n\nP.S.: You can find my presentation on this topic [here](https://docs.google.com/presentation/d/1ElrYSbSfCI-ROX1p0QvQN5VWhsBcNSIHTYoR9QChVUI/edit#slide=id.p3).","date":"2021-02-01","ogImage":null,"coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphcms.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}},"moreStories":[{"__typename":"Post","title":"Systemd Services are frustratingly to make safe","slug":"systemd-frustration","excerpt":"This article takes a dive into what it takes to set up a systemd service with the principle of least privilege.","coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphcms.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}},{"__typename":"Post","title":"Variants are incredibly powerful","slug":"variants-are-powerful","excerpt":"Variants are an incredibly powerful tool to express the state of your program!","coverImage":null,"author":{"__typename":"Author","name":"Nigel Schuster","slug":"nigel-schuster","picture":{"__typename":"Asset","url":"https://media.graphcms.com/resize=fit:crop,height:100,width:100/1bF1qLxsSbElgNK5x6t6"}}}],"__typename":"Query"},"__N_SSG":true}